eisup_2019_docmng_integration/src/Documents/ttk_НастройкаПользовательскихПодписок/ttk_НастройкаПользовательскихПодписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_НастройкаПользовательскихПодписок</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ttk_ПользовательскиеПодпискиНаСобытия</registerRecords>
  <attributes>
    <name>ВидПодписки</name>
    <type>
      <types>CatalogRef.ttk_ВидыПользовательскихПодписок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСписком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписки</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/ttk_НастройкаПользовательскихПодписок/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДобавитьНесколько.Пометка = Объект.ВыводитьСписком;
	Элементы.Группа2.Видимость = Не Объект.ВыводитьСписком;
	Элементы.Группа1.Видимость = Объект.ВыводитьСписком;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНесколько(Команда)
	
	Если Объект.Подписки.Количество() > 1 Тогда
		Ответ = Вопрос("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПерваяСтрока = Новый Структура;
			ПерваяСтрока.Вставить("Пользователь", Объект.Подписки[0].Пользователь);
			ПерваяСтрока.Вставить("Подразделение", Объект.Подписки[0].ПодразделениеОрганизации);
			Объект.Подписки.Очистить();
			НоваяСтрока = Объект.Подписки.Добавить();
			НоваяСтрока.Пользователь = ПерваяСтрока.Пользователь;			
			НоваяСтрока.ПодразделениеОрганизации = ПерваяСтрока.Подразделение;
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
			
	Элементы.ДобавитьНесколько.Пометка = Не Элементы.ДобавитьНесколько.Пометка;
	Объект.ВыводитьСписком = Элементы.ДобавитьНесколько.Пометка;
	Элементы.Группа2.Видимость = Не Объект.ВыводитьСписком;
	Элементы.Группа1.Видимость = Объект.ВыводитьСписком;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПодразделениямНаСервере(Организация)
	
	Выборка = Документы.ttk_НастройкаПользовательскихПодписок.ЗаполнитьПоПодразделению(Организация);
	Объект.Подписки.Загрузить(Выборка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПодразделениям(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Предупреждение("Не указана организация для которой выполнять заполнение.");
		Возврат;
	КонецЕсли;
	
	Если Объект.Подписки.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПоПодразделениямНаСервере(Объект.Организация);
	
КонецПроцедуры
